0.1.0/tutorials/incompressible/dym-pimple/moving_cone/0/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
  movingWall
  {
    type            movingWallVelocity;
    value           $internalField;
  }
  farFieldMoving
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  fixedWall
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  left
  {
    type            pressureInletOutletVelocity;
    value           $internalField;
  }
  farField
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  back
  {
    type            wedge;
  }
  front
  {
    type            wedge;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
